app/controllers/comments_controller.rb

  def create
    @comment = @project.comments.build(comment_params.merge(user: current_user))
    if @comment.save
---
INSERT INTO `comments` (`user_id`, `project_id`, `content`, `created_at`, `updated_at`) VALUES (1, 1, 'Test', '2025-02-06 02:03:29.165489', '2025-02-06 02:03:29.165489')

  def set_project
    @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1