app/controllers/projects_controller.rb

INSERT INTO `projects` (`name`, `status`, `created_at`, `updated_at`) VALUES ('Sample project', 0, '2025-02-06 01:57:30.409115', '2025-02-06 01:57:30.409115')
SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all.presence || [Project.create(name: "Sample project")]

SELECT `comments`.* FROM `comments` WHERE `comments`.`project_id` = 1 ORDER BY `comments`.`created_at` DESC
SELECT `status_changes`.* FROM `status_changes` WHERE `status_changes`.`project_id` = 1 ORDER BY `status_changes`.`created_at` DESC
---
  def show
    @comments = @project.comments.order(created_at: :desc)
    @status_changes = @project.status_changes.order(created_at: :desc)

UPDATE `projects` SET `projects`.`status` = 1, `projects`.`updated_at` = '2025-02-06 02:00:10.058578' WHERE `projects`.`id` = 1
INSERT INTO `status_changes` (`user_id`, `project_id`, `status`, `created_at`, `updated_at`) VALUES (1, 1, 1, '2025-02-06 02:00:10.084880', '2025-02-06 02:00:10.084880')
---
  def update_status
    @project.update(status: params[:status])
    StatusChange.create!(user: current_user, project: @project, status: params[:status])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def set_project
    @project = Project.find(params[:id])